/*
 Navicat Premium Dump SQL

 Source Server         : root
 Source Server Type    : MySQL
 Source Server Version : 50726 (5.7.26)
 Source Host           : localhost:3306
 Source Schema         : scoremaster

 Target Server Type    : MySQL
 Target Server Version : 50726 (5.7.26)
 File Encoding         : 65001

 Date: 04/06/2025 17:33:44
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for scores
-- ----------------------------
DROP TABLE IF EXISTS `scores`;
CREATE TABLE `scores`  (
  `学号` int(11) NULL DEFAULT NULL,
  `姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `e1` int(11) NULL DEFAULT NULL,
  `e2` int(11) NULL DEFAULT NULL,
  `e3` int(11) NULL DEFAULT NULL,
  `高等数学1-1 [4]` int(11) NULL DEFAULT NULL,
  `高等数学1-2 [5]` int(11) NULL DEFAULT NULL,
  `线性代数 [3]` int(11) NULL DEFAULT NULL,
  `大学物理4-1 [3]` int(11) NULL DEFAULT NULL,
  `信息技术导论 [2]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `高级语言程序设计 [3]` int(11) NULL DEFAULT NULL,
  `高级语言程序设计实验 [1]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `面向对象程序设计 [3]` int(11) NULL DEFAULT NULL,
  `计算机组成原理 [3]` int(11) NULL DEFAULT NULL,
  `离散数学 [4]` int(11) NULL DEFAULT NULL,
  `汇编语言程序设计 [2]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `汇编语言程序设计实验 [1]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `程序设计训练 [1]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `计算机组成原理课程设计 [1]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `数字系统与逻辑设计 [3]` int(11) NULL DEFAULT NULL,
  `数字系统与逻辑设计实验 [1]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `JAVA语言程序设计 [3]` int(11) NULL DEFAULT NULL,
  `计算机专业认知 [.5]` int(11) NULL DEFAULT NULL,
  `思想道德修养与法律基础 [3]` int(11) NULL DEFAULT NULL,
  `中国近现代史纲要 [2]` double NULL DEFAULT NULL,
  `马克思主义基本原理概论 [3]` int(11) NULL DEFAULT NULL,
  `毛泽东思想和中国特色社会主义理论体系概论（1） [3]` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL,
  `贵州省情 [1]` int(11) NULL DEFAULT NULL,
  `体育1 [1]` int(11) NULL DEFAULT NULL,
  `大学生职业生涯规划 [.5]` int(11) NULL DEFAULT NULL,
  `军事理论及军事训练 [2]` double NULL DEFAULT NULL,
  `大学生心理健康 [1]` int(11) NULL DEFAULT NULL
) ENGINE = MyISAM CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of scores
-- ----------------------------
INSERT INTO `scores` VALUES (2025051222, 'Linux', 83, 91, 84, NULL, NULL, 100, 94, NULL, 92, '优秀', NULL, 87, 92, '优', '优', NULL, '80', NULL, NULL, 90, NULL, 87, 85, 90, '94', 92, 79, 94, 85, 84);
INSERT INTO `scores` VALUES (2018182815, '李七四', 90, 90, 84, 89, 97, 97, NULL, NULL, 84, '及格', NULL, 95, 88, '中', '优', NULL, '优秀', NULL, NULL, 69, NULL, 88, 93, 92, '91', 76, 79, 91, 86, 72);
INSERT INTO `scores` VALUES (2018182817, '李四七', 83, 85, 78, 79, 76, 83, 81, '93', 96, '优秀', 93, 94, 86, '优', '优', '优秀', '90', 97, '优秀', 99, 100, 88, 92, 90, '92', 85, 92, 94, 90, 90);
INSERT INTO `scores` VALUES (2018182818, '张六五', 86, 85, 87, 100, 91, NULL, NULL, NULL, NULL, '优', NULL, 95, 85, '优', '优', NULL, '90', NULL, NULL, 99, NULL, 87, 93, 92, '85', 80, 75, 90, 86, 89);
INSERT INTO `scores` VALUES (1018101810, '王王王', 90, 93, 84, 91, 92, 88, 87, NULL, 90, '中等', NULL, 85, 89, NULL, NULL, NULL, '良好', NULL, NULL, 81, NULL, 87, 80, 90, '90', 92, 75, 92, 81, 85);
INSERT INTO `scores` VALUES (2018182820, '王七二', 82, 84, 73, 93, 86, 91, 89, '优秀', 92, '优秀', 86, 94, 86, '优', '优', '优秀', '90', 88, '90', 99, 100, 85, 89, 90, '78', 72, 89, 75, 85.5, 81);
INSERT INTO `scores` VALUES (2018182821, '杨四八', 78, 83, 67, 95, 81, NULL, NULL, NULL, NULL, '优秀', NULL, 96, 87, '优', '优', NULL, '优秀', NULL, NULL, 99, NULL, 85, 94, 94, '81', 90, NULL, 90, 82, 91);
INSERT INTO `scores` VALUES (2018182822, '杨五七', 76, 89, 86, 89, 77, 85, 80, '89', 91, '良好', 86, 95, 81, '优', '优', '85', '90', 87, '优秀', 99, 100, 87, 92, 91, '88', 81, NULL, 85, 85, 88);
INSERT INTO `scores` VALUES (2018182823, '杨五九', 83, 83, 78, 83, 89, 78, NULL, NULL, 88, '优秀', NULL, 90, 84, '优', '良', NULL, '90', NULL, NULL, 99, NULL, 89, 93, 85, '81', 87, 94, 95, 92, 81);
INSERT INTO `scores` VALUES (2018182824, '李九九', 82, 82, 80, 85, 85, 86, 91, '86', 89, '80', 92, 97, 84, '良', '良', '优秀', '优秀', 84, '90', 87, 100, 80, 91, 93, '91', 84, 77, 80, 88, 87);
INSERT INTO `scores` VALUES (2018182825, '李二七', 88, 71, 80, 95, 87, 94, 98, '91', 91, '优', 84, 82, 89, '中', '优', '良好', '良好', 84, '90', 81, 100, 85, 92, 85, '83', 93, 82, 82, 90.5, 86);
INSERT INTO `scores` VALUES (2018182826, '李六九', 74, 80, 79, 89, 86, 94, 89, '87', 91, '良', 88, 80, 84, '中', '优', '优秀', '90', 84, '90', 87, 100, 84, 91, 82, '74', 93, 80, 95, 91, 85);
INSERT INTO `scores` VALUES (2018182827, '李二四', 76, 84, 82, 92, 73, 90, 77, '83', 86, '优秀', 93, 92, 79, '良', '中', '优秀', '优秀', 96, '良好', 81, 100, 85, 95, 88, '85', 92, 86, 92, 87, 93);
INSERT INTO `scores` VALUES (2018182828, '徐六一', 83, 82, 76, 91, 87, NULL, NULL, NULL, 91, '中等', NULL, 79, 79, '优', '良', NULL, '90', NULL, NULL, 99, NULL, 85, 93, 91, '91', 80, 70, 88, 94, 83);
INSERT INTO `scores` VALUES (2018182829, '徐十四', 70, 69, 78, 80, 86, 78, 92, '89', 100, '90', 90, 83, 90, '优', '优', '良好', '90', 87, '90', 99, 100, 82, 81, 92, '82', 77, 60, 75, 84, 79);
INSERT INTO `scores` VALUES (2018182830, '张四四', 88, 87, 86, 87, 84, 87, 83, '88', 95, '优', 89, 84, 67, '良', '中', '优秀', '90', 76, '90', 90, 100, 85, 89, 87, '86', 74, 78, 78, 87, 86);
INSERT INTO `scores` VALUES (2018182831, '张二五', 82, 90, 85, 85, 86, 83, 90, '89', 88, '优', 76, 82, 82, '中', '优', '良好', '良好', 73, '90', 81, 100, 81, 87, 87, '93', 84, 79, 72, 88, 86);
INSERT INTO `scores` VALUES (2018182832, '张七七', 83, 75, 80, 77, 87, 82, 89, '86', 98, '80', 78, 89, 81, '及', '良', '良好', '良好', 89, '90', 90, 100, 85, 89, 81, '83', 72, 73, 77, 85, 86);
INSERT INTO `scores` VALUES (2018182834, '徐六九', 90, 68, 84, 89, 77, 90, 85, '优秀', 93, '良好', 81, 84, 87, '及', '中', '不及格', '80', 83, '70', 90, 100, 86, 86, 85, '90', 73, 80, 88, 87, 92);
INSERT INTO `scores` VALUES (2018182835, '李九二', 76, 84, 76, 78, 71, 95, 92, '90', 81, '良好', 86, 98, 86, '及', '良', '85', '良好', 89, '良好', 99, 100, 81, 91, 86, '86', 89, 69, 84, 85, 85);
INSERT INTO `scores` VALUES (2018182836, '李二九', 85, 86, 85, 83, 69, 93, NULL, '85', 74, '良', 73, NULL, NULL, NULL, NULL, '良好', NULL, 87, '90', NULL, 100, 87, 91, 86, NULL, 79, 81, 60, 82, 81);
INSERT INTO `scores` VALUES (2018182837, '杨四一', 79, 77, 77, 94, 83, 80, 87, '84', 90, '优秀', 89, 91, 91, '优', '良', '85', '优秀', 86, '优秀', 79, 100, 80, 83, 84, '61', 81, 84, 87, 82, 89);
INSERT INTO `scores` VALUES (2018182839, '徐三一', 80, 76, 77, 83, 69, 84, 94, '优秀', 82, '良好', 79, 88, 83, '优', '优', '优秀', '优秀', 83, '80', 90, 100, 80, 87, 82, '87', 72, 78, 85, 87, 87);
INSERT INTO `scores` VALUES (2018182840, '杨五二', 80, 72, 83, 74, 79, 76, 82, '89', 92, '优秀', 89, 94, 81, '中', '中', '80', '良好', 95, '优秀', 81, 100, 77, 84, 88, '87', 88, 90, 86, 85, 84);
INSERT INTO `scores` VALUES (2018182841, '王二四', 81, 80, 79, 74, 73, 90, 86, '90', 93, '80', 82, 90, 84, '优', '良', '及格', '良好', 85, '90', 67, 100, 85, 84, 89, '76', 83, 78, 80, 83, 86);
INSERT INTO `scores` VALUES (2018182842, '刘九六', 72, 76, 77, 87, 70, 81, 97, '83', 87, '良好', 91, 76, 88, '中', '中', '中等', '80', 79, '良好', 99, 100, 87, 90, 88, '82', 90, 78, 96, 81, 91);
INSERT INTO `scores` VALUES (2018182843, '刘十一', 75, 78, 75, 77, 77, 83, 90, '86', 87, '优', 77, 92, 85, '良', '优', '良好', '优秀', 78, '90', 81, 100, 76, 94, 92, '90', 73, 85, 75, 82, 84);
INSERT INTO `scores` VALUES (2018182844, '李二十', 87, 87, 80, 99, 92, NULL, NULL, NULL, 95, '优秀', NULL, 89, 80, '优', '良', NULL, '90', NULL, NULL, NULL, NULL, 86, 93, 88, '84', 88, 84, 64, 86, 83);
INSERT INTO `scores` VALUES (2018182845, '王七四', 70, 72, 73, 76, 85, 90, 85, '89', 91, '良', 86, 86, 78, '优', '优', '优秀', '优秀', 77, '90', 70, 100, 77, 89, 86, '73', 92, 84, 95, 85, 83);
INSERT INTO `scores` VALUES (2018182846, '周三六', 77, 82, 68, NULL, NULL, 96, NULL, NULL, 75, '及格', NULL, 91, 73, '中', '良', NULL, '优秀', NULL, NULL, 69, NULL, 80, 83, 89, '82', 85, 72, 86, 79, 83);
INSERT INTO `scores` VALUES (2018182847, '李三六', 73, 74, 74, 76, 77, 82, 81, '87', 91, '优', 86, 75, 71, '中', '优', '优秀', '良好', 68, '90', 79, 100, 84, 88, 87, '81', 92, 85, 85, 92, 87);
INSERT INTO `scores` VALUES (2018182848, '王二三', 80, 77, 77, 67, 70, 86, 94, '87', 90, '优秀', 78, 80, 84, '优', '良', '优秀', '80', 85, '良好', 99, 100, 78, 85, 90, '84', 78, 98, 87, 84, 91);
INSERT INTO `scores` VALUES (2018182849, '杨五四', 77, 77, 85, 67, 91, 89, 82, NULL, 94, '不及格', NULL, 89, 82, '优', '优', NULL, '80', NULL, NULL, 69, NULL, 79, 88, 90, '91', 89, 68, 85, 87, 92);
INSERT INTO `scores` VALUES (2018182850, '李八六', 84, 86, 80, 85, 66, 83, 87, '良好', 89, '优秀', 69, 82, 71, '优', '优', '优秀', '80', 73, '90', 99, 100, 82, 89, 80, '84', 79, 78, 80, 82, 85);
INSERT INTO `scores` VALUES (2018182851, '周二七', 75, 76, 83, 89, 69, 88, 91, '良好', 80, '良好', 80, 90, 73, '良', '良', '优秀', '90', 90, '80', 70, 100, 86, 84, 84, '81', 74, 79, 69, 86, 84);
INSERT INTO `scores` VALUES (2018182852, '王十三', NULL, NULL, 66, NULL, NULL, NULL, 84, '87', 81, '70', 81, 77, 70, '中', '优', '及格', '80', 89, '90', 99, 100, NULL, NULL, NULL, '84', NULL, NULL, NULL, 85, 0);
INSERT INTO `scores` VALUES (2018182853, '王四三', 71, 75, 81, 83, 79, 76, 83, '79', 81, '优秀', 78, 87, 68, '中', '优', '85', '80', 82, '良好', 99, 100, 81, 87, 85, '90', 78, 74, 87, 85, 89);
INSERT INTO `scores` VALUES (2018182854, '杨九九', 79, 78, 71, 88, 89, 91, 87, '良好', 77, '良好', 82, 83, 62, '中', '中', '良好', '80', 88, '80', 81, 100, 81, 81, 80, '70', 82, 88, 76, 84, 91);
INSERT INTO `scores` VALUES (2018182855, '张五三', 91, 86, 79, 88, 74, 63, NULL, NULL, 84, '优秀', NULL, 90, 82, '优', '优', NULL, '中等', NULL, NULL, 84, NULL, 86, 90.7, 91, '70', 66, NULL, 64, 84, 71);
INSERT INTO `scores` VALUES (2018182856, '徐四二', 76, 73, 80, 87, 84, NULL, 91, NULL, 77, '不及格', NULL, 77, 70, '良', '优', NULL, '良好', NULL, NULL, 83, NULL, 83, 91, 91, '77', 90, 77, 86, 81, 84);
INSERT INTO `scores` VALUES (2018182857, '王九八', 76, 82, 77, 79, 89, 70, NULL, NULL, 85, '中等', NULL, 86, 70, '优', '中', NULL, '90', NULL, NULL, NULL, NULL, 77, 80, 87, '82', 89, 82, 76, 86, 90);
INSERT INTO `scores` VALUES (2018182858, '杨一五', 84, 86, 85, 66, 74, 69, 79, '87', 95, '80', 84, 79, 73, '优', '良', '不及格', '良好', 73, '90', 99, 100, 78, 79, 76, '71', 77, 78, 70, 85, 85);
INSERT INTO `scores` VALUES (2018182859, '杨二二', 72, 76, 72, NULL, NULL, NULL, 69, NULL, 72, '不及格', NULL, 81, 61, '中', '良', NULL, '良好', NULL, NULL, 67, NULL, 82, 94, 91, '74', 91, 94, 68, 87, 88);
INSERT INTO `scores` VALUES (2018182860, '杨四三', 79, 80, 71, 77, 73, 90, 87, '84', 91, '80', 86, 76, 65, '及', '良', '良好', '80', 84, '90', 99, 100, 73, 80, 84, '70', 77, 61, 72, 86, 82);
INSERT INTO `scores` VALUES (2018182861, '杨八五', 68, 71, 76, 65, 69, 75, 89, '84', 78, '良好', 71, 84, 67, '优', '优', '80', '优秀', 91, '优秀', 90, 100, 83, 84, 88, '88', 91, 80, 83, 76, 93);
INSERT INTO `scores` VALUES (2018182862, '刘八二', 73, 79, 74, 72, 60, 82, 89, '优秀', 89, '良好', 82, 87, 77, '中', '中', '及格', '良好', 80, '90', 81, 100, 85, 90, 82, '82', 81, 85, 73, 86, 87);
INSERT INTO `scores` VALUES (2018182863, '李六四', 72, 70, 68, 86, 77, 87, 80, '优秀', 88, '良好', 86, 82, 78, '中', '良', '及格', '80', 83, '70', 69, 100, 81, 87, 78, '75', 74, 96, 81, 78, 85);
INSERT INTO `scores` VALUES (2018182864, '李七三', 75, 77, 70, 73, 94, 88, 87, '85', 87, '优', 75, 69, 67, '中', '中', '良好', '90', 76, '90', 81, 100, 78, 83, 84, '76', 78, 85, 70, 85, 78);
INSERT INTO `scores` VALUES (2018182865, '李五六', 70, 83, 71, 87, 72, 88, 67, '良好', 95, '优秀', 96, 61, 73, '中', '中', '优秀', '及格', 85, '90', 99, 100, 73, 89, 85, '74', 85, 95, 86, 87, 85);
INSERT INTO `scores` VALUES (2018182866, '杨二七', 71, 68, 67, 85, 80, 85, 81, '89', 74, '良好', 71, 89, 83, '中', '良', '86', '优秀', 82, '不及格/0', 87, 100, 82, 76, 81, '68', 72, 90, 90, 80, 79);
INSERT INTO `scores` VALUES (2018182867, '刘五一', 85, 80, 71, 78, 70, 80, 75, '90', 84, '良好', 84, 82, 73, '中', '良', '中等', '中等', 90, '良好', 69, 100, 85, 85, 87, '62', 66, 82, 96, 82, 86);
INSERT INTO `scores` VALUES (2018182869, '周九四', 61, 71, 62, 91, 60, 88, 80, '优秀', 96, '优秀', 78, 84, 84, '及', '及', '中等', '中等', 65, '70', 99, 100, 83, 81, 80, '77', 70, 88, 79, 87, 87);
INSERT INTO `scores` VALUES (2018182870, '李三八', 70, 80, 72, 83, 63, 85, 67, '81', 95, '优秀', 90, 66, 65, '中', '中', '及格', '90', 84, '优秀', 79, 100, 82, 90, 89, '54/65', 88, 80, 96, 81, 87);
INSERT INTO `scores` VALUES (2018182871, '李莉莉', 60, 61, 60, 87, 89, 89, 82, '86', 80, '80', 62, 82, 72, '良', '良', '中等', '良好', 82, '90', 70, 100, 81, 88, 82, '72', 82, 87, 80, 80, 83);
INSERT INTO `scores` VALUES (20100221, '刘七四', 60, 61, 60, 87, 89, 89, 82, '86', 80, '80', 62, 82, 72, '良', '良', '中等', '良好', 82, '90', 70, 100, 81, 88, 82, '72', 82, 87, 80, 80, 83);
INSERT INTO `scores` VALUES (2018182871, '刘七四', 60, 61, 60, 87, 89, 89, 82, '86', 80, '80', 62, 82, 72, '良', '良', '中等', '良好', 82, '90', 70, 100, 81, 88, 82, '72', 82, 87, 80, 80, 83);

SET FOREIGN_KEY_CHECKS = 1;
